<?php
return [
    "blog-desc" => "Больше информации и новостей о нас в нашем блоге",
    "blog-heading" => "Блог Heating Energy",
    "brief" => "Немного о Heating Energy",
    "feedback-desc" => "Наш менеджер ответит вам в ближайшее время. Также вы можете связаться с поддержкой через чат справа в нижнем углу.",
    "feedback-heading" => "Вопрос менеджеру?",
    "footer-info" => "Мы рады предоставить наши товары и ответить на ваши вопросы.",
    "footer-other-info" => "Другая информация",
    "footer-services" => "Дополнительная информация",
    "heading" => "Отопительные системы<br> и детали всех видов",
    "heading-cats" => "Категорий",
    "heading-desc" => "Онлайн каталог компании Heating Energy предоставит вам более  товаров от целых<br>систем до самых маленьких деталей, где вы найдете, то что ищете!",
    "heading-prods" => "товаров",
    "popular-desc" => "Наиболее востребованные товары нашей компании",
    "popular-heading" => "Популярные товары"
];
