<?php
return [
    "address" => "Адрес",
    "btn-send" => "Отправить",
    "consultation" => "Консультация",
    "consultation-desc" => "Мы поможем в выборе того, чего вам нужно, дадим советы и порекомендуем лучшее решение!",
    "consultation-heading" => "Бесплатная консультация",
    "h6" => "Статья",
    "phone" => "Телефон",
    "search" => "Поиск...",
    "dev-header" => "Уже делаем",
    "dev-desc" => "В разделе Услуги вы получите интерактивные услуги, которые позволят вам подобрать именно то, что нужно вам."
];
